In [ ]:
TYPES OF NORMALIZATION:

1. 1NF-> ONE CELL SHOULD NOT HAVE MORE THAN ONE VALUE
      -> ATOMIC VALUES
      -> DEFINITION --> EACH COLUMN SHOULD CONTAIN ATOMIC (SINGLE) VALUE

2. 2NF-> TABLE MUST BE 1NF
      -> NO PARTIAL DEPENDENCY

3. 3NF-> TABLE MUST BE 2NF
      -> NOT DEPENDENT ON ANOTHER ROW WHICH IS ALREADY DEPENDENT ON ANY OTHER ROW
      -> NO TRANSITIVE DEPENDENCY



mysql> show databases;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| school             |
| student            |
| sys                |
+--------------------+
6 rows in set (0.03 sec)

mysql> use mysql;
Database changed
mysql> create table marks(
    ->     student_id int,
    ->     subject varchar(50),
    ->     marks int);
Query OK, 0 rows affected (0.10 sec)

mysql> insert into marks values
    -> (1,"math",80),
    -> (2,"sql",90);
Query OK, 2 rows affected (0.01 sec)
Records: 2  Duplicates: 0  Warnings: 0

mysql> select* from marks;
+------------+---------+-------+
| student_id | subject | marks |
+------------+---------+-------+
|          1 | math    |    80 |
|          2 | sql     |    90 |
+------------+---------+-------+
2 rows in set (0.00 sec)

In [ ]:
SQLite: IT IS A LIGHTWEIGHT DATABASE THAT STORES DATA IN A SINGLE FILE AND IS INBUILT IN PYTHON


COMMANDS IN SQLite:

connect()--> OPENS DATABASE
cursor()--> RUNS SQL
execute()--> EXECUTES SQL
commit()--> SAVE CHANGES
close()--> CLOSES CONNECTION

In [ ]:
import sqlite3

con = sqlite3.connect("company.db")
cur = con.cursor()

cur.execute("""
CREATE TABLE IF NOT EXISTS employeesss (
    emp_id INTEGER PRIMARY KEY,
    emp_name TEXT,
    salary INTEGER
)
""")

cur.execute("INSERT OR IGNORE INTO employeesss VALUES (1, 'Rohan', 40000)")
cur.execute("INSERT OR IGNORE INTO employeesss VALUES (2, 'Riya', 50000)")

con.commit()

cur.execute("SELECT * FROM employeesss")
rows = cur.fetchall()
for i in rows:
    print(i)

con.close()

(1, 'Rohan', 40000)
(2, 'Riya', 50000)

In [ ]:
import sqlite3
#create() craetes or open database
# connection1 = sqlite3.connect("school.db")
# print("database connected")
# connection1.close()

# connection1 = sqlite3.connect("school.db")
# #cursor()-->run sql
# cur = connection1.cursor()
# print("cursor created")
# connection1.close()

# connection1 = sqlite3.connect("school.db")
# cur = connection1.cursor()
# cur.execute("""CREATE TABLE students (students_id INTEGER, name TEXT, marks INTEGER)""")
# connection1.commit()
# connection1.close()

# connection1 = sqlite3.connect("school.db")
# cur = connection1.cursor()
# cur.execute("""INSERT INTO students VALUES(1,"amit",85),(2,"neha",90)""")
# connection1.commit()
# connection1.close()


# connection1 = sqlite3.connect("school.db")
# cur = connection1.cursor()
# cur.execute("""SELECT * FROM students""")
# row = cur.fetchall()
# for i in row:
#     print(i)
# connection1.close()
connection2 = sqlite3.connect("employee.db")
cur =  connection2.cursor()
cur.executescript("""CREATE TABLE IF NOT EXISTS employee (emp_id INTEGER, emp_name VARCHAR(50), salary INTEGER);
                INSERT INTO employee VALUES (1,"amit",80000),(2,"neha",70000),(3,"ram",560000);""")
connection2.commit()
cur.execute("""SELECT * FROM employee""")
row = cur.fetchall()
for i in row :
    print(i)
connection2.close()

(1, 'amit', 80000)
(2, 'neha', 70000)
(3, 'ram', 560000)

In [ ]:
import sqlite3
'''connect() creates or opens database
connection1 = sqlite3.connect("school.db")
print("Database connected")
connection1.close()'''

'''connection1 = sqlite3.connect("school.db")
# cursor() runs sql
cur = connection1.cursor()
print("Cursor created")
connection1.close()'''

'''connection1 = sqlite3.connect("school.db")
cur = connection1.cursor()
cur.execute("""CREATE TABLE students (id INTEGER, name TEXT, marks INTEGER)""")
connection1.commit()
connection1.close()'''

'''connection1 = sqlite3.connect("school.db")
cur = connection1.cursor()
cur.execute("""INSERT INTO students VALUES(1,"Amit",85)""")
cur.execute("""INSERT INTO students VALUES(2,"Neha",90)""")
connection1.commit()
connection1.close()'''

'''connection1 = sqlite3.connect("school.db")
cur = connection1.cursor()
cur.execute("""select * from students""")
rows = cur.fetchall()
for i in rows:
    print(i)
connection1.close()'''


import sqlite3

con = sqlite3.connect("company.db")
cur = con.cursor()

cur.execute("""
CREATE TABLE IF NOT EXISTS employeesss (
    emp_id INTEGER PRIMARY KEY,
    emp_name TEXT,
    salary INTEGER
)
""")

cur.execute("INSERT OR IGNORE INTO employeesss VALUES (1, 'Rohan', 40000)")
cur.execute("INSERT OR IGNORE INTO employeesss VALUES (2, 'Riya', 50000)")

con.commit()

cur.execute("SELECT * FROM employeesss")
rows = cur.fetchall()
for i in rows:
    print(i)

con.close()

(1, 'Rohan', 40000)
(2, 'Riya', 50000)

In [ ]:
import sqlite3

con = sqlite3.connect("company.db");
cur = con.cursor();

# DDL: Create table
cur.execute("""
CREATE TABLE IF NOT EXISTS employees (
    emp_id INTEGER PRIMARY KEY,
    emp_name TEXT,
    salary INTEGER
);
""");

# Check if column exists before ALTER
cur.execute("PRAGMA table_info(employees);");
columns = [col[1] for col in cur.fetchall()];

if "department" not in columns:
    cur.execute("""
    ALTER TABLE employees
    ADD COLUMN department TEXT;
    """);

# DML: Insert records
cur.execute("""
INSERT OR IGNORE INTO employees
(emp_id, emp_name, salary, department)
VALUES (1, 'Rohan', 40000, 'IT');
""");

cur.execute("""
INSERT OR IGNORE INTO employees
(emp_id, emp_name, salary, department)
VALUES (2, 'Riya', 50000, 'HR');
""");

# DML: Update record
cur.execute("""
UPDATE employees
SET salary = 55000
WHERE emp_id = 2;
""");

# TCL: Transaction
try:
    cur.execute("BEGIN TRANSACTION;");

    cur.execute("""
    INSERT INTO employees
    (emp_id, emp_name, salary, department)
    VALUES (3, 'Aman', 45000, 'Finance');
    """);

    cur.execute("""
    INSERT INTO employees
    (emp_id, emp_name, salary, department)
    VALUES (4, 'Neha', 48000, 'IT');
    """);

    con.commit();
except:
    con.rollback();

# DQL: Select records
cur.execute("SELECT * FROM employees;");
rows = cur.fetchall();
for row in rows:
    print(row);

# DML: Delete record
cur.execute("""
DELETE FROM employees
WHERE emp_id = 1;
""");
con.commit();

# DQL: Final select
cur.execute("SELECT * FROM employees;");
rows = cur.fetchall();
for row in rows:
    print(row);

con.close();

(2, 'Riya', 55000, None)
(3, 'Aman', 45000, None)
(4, 'Neha', 48000, None)
(2, 'Riya', 55000, None)
(3, 'Aman', 45000, None)
(4, 'Neha', 48000, None)

In [ ]:
!pip install psycopg2-binary

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.11-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.whl.metadata (4.9 kB)
Downloading psycopg2_binary-2.9.11-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.whl (4.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4.2/4.2 MB 50.5 MB/s eta 0:00:00
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.11